In [2]:
import pandas as pd
from sklearn.datasets import load_iris
from sklearn.model_selection import train_test_split 
iris_dataset= load_iris()
X_train, X_test, y_train, y_test= train_test_split(iris_dataset['data'] ,iris_dataset['target'], random_state=0)
iris_dataframe= pd.DataFrame(X_train, columns= iris_dataset.feature_names)

### Các hàm thông dụng của dataframe

In [3]:
iris_dataframe.info() #thông tin của dataframe như tên cột, kiểu dữ liệu

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112 entries, 0 to 111
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal length (cm)  112 non-null    float64
 1   sepal width (cm)   112 non-null    float64
 2   petal length (cm)  112 non-null    float64
 3   petal width (cm)   112 non-null    float64
dtypes: float64(4)
memory usage: 3.6 KB

In [4]:
iris_dataframe.columns #tên các comlums, nó ở dạng obj

Index(['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)',
       'petal width (cm)'],
      dtype='object')

In [5]:
list(iris_dataframe.columns)#tên các comlums, để trong 1 list

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [6]:
iris_dataframe.index #đánh số từ bao nhiêu đến bao nhiêu, index=1 => liên tục, không bị ngắt quãng

RangeIndex(start=0, stop=112, step=1)

In [7]:
iris_dataframe.describe() #thống kê lại cả bảng
#count: số tổng (được áp dụng với cột nào kiểu dữ liệu là số, nếu cột kiểu dữ liệu là obj/ string => không hiển thị)
#mean: giá trị trung bình
#std: độ lệch chuẩn

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,112.000000,112.000000,112.000000,112.000000
mean,5.886607,3.051786,3.796429,1.223214
std,0.871314,0.436196,1.800697,0.781427
min,4.300000,2.000000,1.100000,0.100000
25%,5.100000,2.800000,1.575000,0.300000
50%,5.800000,3.000000,4.250000,1.300000
75%,6.500000,3.300000,5.200000,1.900000
max,7.900000,4.400000,6.900000,2.500000

In [8]:
iris_dataframe.describe(include="all") #thống kê lại cả bảng bao gồm cả cột mà datatype là string /obj
#những gì thống kê được nó sẽ thông kê ra

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,112.000000,112.000000,112.000000,112.000000
mean,5.886607,3.051786,3.796429,1.223214
std,0.871314,0.436196,1.800697,0.781427
min,4.300000,2.000000,1.100000,0.100000
25%,5.100000,2.800000,1.575000,0.300000
50%,5.800000,3.000000,4.250000,1.300000
75%,6.500000,3.300000,5.200000,1.900000
max,7.900000,4.400000,6.900000,2.500000

### loc and iloc

In [9]:
iris_dataframe.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.9               3.0                4.2               1.5
1                5.8               2.6                4.0               1.2
2                6.8               3.0                5.5               2.1
3                4.7               3.2                1.3               0.2
4                6.9               3.1                5.1               2.3

In [10]:
iris_dataframe.loc[(iris_dataframe['sepal length (cm)']==6.9)  & (iris_dataframe['petal length (cm)']==5.1), ['sepal length (cm)', 'sepal width (cm)']] 
#lọc ra những giá trị theo yêu cầu
#trong trường hợp bình thườn, tên cột không chứa dấu "cách" =>iris_dataframe.loc[iris_dataframe.colName == 6.9]
#cái argument thứ 2 là 1 list các cột mình muốn hiển thị ra

   sepal length (cm)  sepal width (cm)
4                6.9               3.1

In [11]:
iris_dataframe.iloc[10]

sepal length (cm)    6.0
sepal width (cm)     2.2
petal length (cm)    5.0
petal width (cm)     1.5
Name: 10, dtype: float64

In [12]:
type(iris_dataframe.iloc[10])
#nó có kiểu dữ liệu là series

pandas.core.series.Series

In [13]:
iris_dataframe.iloc[[10]] #thêm dấu [] bên trong thì nó return ra kiểu là dataframe

    sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
10                6.0               2.2                5.0               1.5

In [14]:
iris_dataframe.iloc[3:11] #từ hàng 3 CHO ĐẾN 10 nên phải dùng 11

    sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
3                 4.7               3.2                1.3               0.2
4                 6.9               3.1                5.1               2.3
5                 5.0               3.5                1.6               0.6
6                 5.4               3.7                1.5               0.2
7                 5.0               2.0                3.5               1.0
8                 6.5               3.0                5.5               1.8
9                 6.7               3.3                5.7               2.5
10                6.0               2.2                5.0               1.5

In [15]:
iris_dataframe.iloc[3:5] 
# đằng trước : không có gì => ngầm hiểu đó là từ 0 đến -1 là cái áp chót

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
3                4.7               3.2                1.3               0.2
4                6.9               3.1                5.1               2.3

In [16]:
iris_dataframe.iloc[3:5, :-2]

   sepal length (cm)  sepal width (cm)
3                4.7               3.2
4                6.9               3.1

In [17]:
iris_dataframe.iloc[3:5, -1] #chỉ lấy cột nào

3    0.2
4    2.3
Name: petal width (cm), dtype: float64

### Data Manipulation

In [18]:
#do data ban đầu không có cột nào chứa ký tự là chữ vd như '$'
# => tạo ra một dataframe mới
X_new_data_manipulation= {'Name':['phong','phong','huong','van','son'],'Month':[1,2,5,7,10], 'Salary':['$5','$90','$4', '$2', '$10']}
df_new_data_manipulation=pd.DataFrame(X_new_data_manipulation)
print(X_new_data_manipulation)
print(df_new_data_manipulation)
#X_new_data_manipulation[2].dtype

{'Name': ['phong', 'phong', 'huong', 'van', 'son'], 'Month': [1, 2, 5, 7, 10], 'Salary': ['$5', '$90', '$4', '$2', '$10']}
    Name  Month Salary
0  phong      1     $5
1  phong      2    $90
2  huong      5     $4
3    van      7     $2
4    son     10    $10

In [19]:
df_new_data_manipulation.Salary.dtype
df_new_data_manipulation.Name.dtype
#type 'o' => obj trong python
# https://github.com/CodexploreRepo/data_science/blob/main/Pages/A02_Pandas_Cheat_Sheet.md

dtype('O')

In [20]:
# ví dụ sau này cần lấy salary đẻ build model => cần convert từ obj sang số 
df_new_data_manipulation.Salary.apply(lambda x : x.replace('$',''))
#đơn giản là dùng lamda để thay thế tất cả '$' =>''

0     5
1    90
2     4
3     2
4    10
Name: Salary, dtype: object

In [21]:
# bây giờ cần chuyển nó thành fload
df_new_data_manipulation.Salary.apply(lambda x : float(x.replace('$','')))
# số thực 64 bit

0     5.0
1    90.0
2     4.0
3     2.0
4    10.0
Name: Salary, dtype: float64

In [22]:
df_new_data_manipulation.Salary=df_new_data_manipulation.Salary.apply(lambda x : float(x.replace('$','')))
df_new_data_manipulation.head()

    Name  Month  Salary
0  phong      1     5.0
1  phong      2    90.0
2  huong      5     4.0
3    van      7     2.0
4    son     10    10.0

### tạo thêm cột cho df

In [23]:
df_new_data_manipulation['total_money'] = df_new_data_manipulation.Month*df_new_data_manipulation.Salary
df_new_data_manipulation

    Name  Month  Salary  total_money
0  phong      1     5.0          5.0
1  phong      2    90.0        180.0
2  huong      5     4.0         20.0
3    van      7     2.0         14.0
4    son     10    10.0        100.0

### Tính tổng 1 cột

In [24]:
revenue=df_new_data_manipulation['total_money'].sum()
print(revenue)

319.0

In [25]:
not_sort=df_new_data_manipulation.groupby("Name")['total_money'].sum()
#groupby tất cả theo tên rồi chỉ lấy cột tiền sau đó sum thì ra của mỗi người

In [26]:
not_sort.sort_values()
#sort tăng dần

Name
van       14.0
huong     20.0
son      100.0
phong    185.0
Name: total_money, dtype: float64

In [27]:
not_sort.sort_values(ascending=False)
#sort giảm dần

Name
phong    185.0
son      100.0
huong     20.0
van       14.0
Name: total_money, dtype: float64

### unique value

In [28]:
df_new_data_manipulation.Name.value_counts()
#số lượng xuất hiện theo tên

phong    2
son      1
huong    1
van      1
Name: Name, dtype: int64

In [29]:
df_new_data_manipulation.Name.value_counts().count()
#số lượng tên xuất hiện

4

In [30]:
df_new_data_manipulation.Name.nunique()
#tương tự trên

4